#include "NTC.h"
#include "adc.h"
#include "usart.h"
/*
温度NTC传感器
温度测量范围： -50-110 ℃
测量精度：±0.5℃
分辨率：温度：0.1℃
阻值：10K（25℃时）
数据表：
         -9.5 ℃ -> + 100 ℃   实际值*1000
                     0.5 ℃   一档
 
*/
#define Xref 3300/4096   //AD采样电源电压3.3V放大1000倍
#define adc_ch 1		//adc通道

#define Vref 2500       //基准电压放大1000倍
#define Rref 2000        //分压电阻2K

const unsigned int NTC3950_10K[220] = {	
				
	        53880,52420,51040,49660,48370,47080,45860,44640,43490,42340,41250,40160,39140,38120,37160,36200,35290,34380,33520,32660,     /*  -9.5 ℃ -  0 ℃ 20位*/
					31850,31040,30270,29500,28780,28060,27370,26680,26040,25400,24790,24180,23600,23020,22470,21920,21400,20880,20390,19900,     /*   0.5 ℃ - 10 ℃ */	
					19435,18970,18630,18290,17775,17260,16860,16460,16085,15710,15355,15000,14660,14320,14000,13680,13375,13070,12780,12490,     /*  10.5 ℃ - 20 ℃ */	
					12215,11940,11680,11420,11170,10920,10685,10450,10225,10000, 9787, 9574, 9370, 9166, 8972, 8778, 8629, 8480, 8269, 8058,     /*  20.5 ℃ - 30 ℃ */	
					 7891, 7724, 7564, 7404, 7251, 7098, 6953, 6808, 6670, 6532, 6400, 6268, 6141, 6015, 5895, 5776, 5661, 5546, 5436, 5326,     /*  30.5 ℃ - 40 ℃ */	
					 5222, 5118, 5018, 4918, 4822, 4726, 4635, 4544, 4456, 4368, 4285, 4202, 4113, 4024, 3956, 3888, 3815, 3742, 3672, 3602,     /*  40.5 ℃ - 50 ℃ */	 
					 3535, 3468, 3404, 3340, 3278, 3216, 3157, 3098, 3042, 2986, 2932, 2878, 2826, 2774, 2724, 2674, 2627, 2580, 2534, 2488,     /*  50.5 ℃ - 60 ℃ */	
					 2444, 2400, 2358, 2316, 2275, 2234, 2196, 2158, 2120, 2082, 2047, 2012, 1977, 1942, 1909, 1876, 1844, 1813, 1782, 1751,     /*  60.5 ℃ - 70 ℃ */	
					 1722, 1693, 1665, 1637, 1609, 1582, 1556, 1530, 1505, 1480, 1455, 1430, 1407, 1385, 1363, 1341, 1319, 1298, 1277, 1256,     /*  70.5 ℃ - 80 ℃ */
	         1236, 1216, 1197, 1178, 1159, 1141, 1123, 1105, 1088, 1071, 1054, 1038, 1022, 1006,  991,  975,  960,  945,  930,  916,     /*  80.5 ℃ - 90 ℃ */
	          902,  888,  875,  862,  849,  836,  824,  811,  799,  787,  776,  764,  753,  741,  731,  720,  710,  699,  689,  679,     /*  90.5 ℃ - 100℃ */
};


 /*****
		-9.5  ℃ - 100 ℃ （TM 为实际温度*10）
****/
int16_t read_NTC1(u16 Val_NTC)
{	
//	u16 Val_NTC;
	u16 V_NTC;  //ADC采样值转换为电压值*1000  0~2500
	u16 R_NTC;  //NTC实时阻值
	u32 temp;
	u8 i;
	int16_t TM;

//	Val_NTC = Get_Adc_Average(adc_ch,10);/**adc通道要根据设置定**/
//	if(Val_NTC>3000)  //2.5V采样值约为3100
//		return 2000;   //NTC未接
//	if(Val_NTC<100)
//		return 3000;   //NTC短地
	
	
	V_NTC = Val_NTC*Xref;
	temp=V_NTC*Rref;
	R_NTC = temp/(Vref-V_NTC);
//	R_NTC = V_NTC/((Vref-V_NTC)/Rref);//是这么算的没错 但不能这么写，因为(Vref-V_NTC)/Rref运算时很可能等于0
	
/*********查表************/	
//	for (i=0;i<220;i++) // -10  ℃ - 100 ℃ 
//	 {
//	  if (R_NTC>NTC3950_10K[i]) break;	  
//	 }
//	if(i>=220)
//		 return 3000;
	
	i = look_up_table(NTC3950_10K,220,R_NTC);//折半法查表
//	if(i == 0)
//		return 3000;
	
	TM= i*5 - 95;	//(-负温度)  
 return TM;	
}

 //*************************************  
// 函数名称：FineTab  二分查找算法 ->查温度表  
// 函数功能：查找数据在表中对应的位置 表中数据从大到小  
// 入口参数：表地址、表长度、要查找的数据  
// 出口参数：无  
// 返 回 值：数据在表中的位置  
//*************************************  
u8 look_up_table(const unsigned int *a,u8 ArrayLong,u16 data)
{    
    u16 begin,end,middle ;  
    u8 i ;  
    begin = 0 ;  
    end = ArrayLong-1 ;  
    i = 0  ;  
    if(data >= a[begin]) return begin ;  
    else if(data <= a[end]) return end ;  
    while(begin < end)  
    {  
            middle = (begin+end)/2 ;  
            if(data == a[middle] ) break ;  
            if(data < a[middle] && data > a[middle+1]) break ;   
            if(data > a[middle])  end = middle ;                      
            else begin = middle ;      
            if(i++ > ArrayLong) break ;  
    }  
    if(begin > end ) return 0 ;   
    return middle ;  
}




